{
  "games": [
    {
      "id": "game1",
      "name": "Space Adventure",
      "description": "Embark on an exciting journey through the galaxy, exploring unknown planets and civilizations. Make alien friends, collect rare resources, unlock powerful weapons, and become a legendary space explorer.",
      "image": "img/game1.jpg",
      "url": "games/game1.html",
      "category": "adventure",
      "type": "popular"
    },
    {
      "id": "game2",
      "name": "Battlefield Sharpshooter",
      "description": "Enter intense multiplayer battlefields to test your shooting skills and tactical abilities. Choose your weapons, build your squad, and dominate the battlefield. Every battle is a unique experience!",
      "image": "img/game2.jpg",
      "url": "games/game2.html",
      "category": "action",
      "type": "popular"
    },
    {
      "id": "game3",
      "name": "Magic Puzzles",
      "description": "Exercise your magical talents in this engaging puzzle game, solve complex riddles, and collect mysterious runes. Find the lost spellbook and save the cursed kingdom.",
      "image": "img/game3.jpg",
      "url": "games/game3.html",
      "category": "puzzle",
      "type": "new"
    },
    {
      "id": "game4",
      "name": "Kingdom Conqueror",
      "description": "Build your kingdom, train a powerful army, and compete with other players for resources and territory. Develop strategies, form alliances, and rule the entire continent to become the true king.",
      "image": "img/game4.jpg",
      "url": "games/game4.html",
      "category": "strategy",
      "type": "new"
    },
    {
      "id": "game5",
      "name": "Racing Fever",
      "description": "Experience the thrill of high-speed racing, driving various luxury cars through the world's most challenging tracks. Customize your vehicles, upgrade performance, win championships, and become a racing champion.",
      "image": "img/game5.jpg",
      "url": "games/game5.html",
      "category": "sports",
      "type": "popular"
    },
    {
      "id": "game6",
      "name": "City Builder",
      "description": "Design and build your dream city, plan roads, construct infrastructure, and meet citizens' needs. Balance economic development with environmental protection to create a thriving metropolis.",
      "image": "img/game6.jpg",
      "url": "games/game6.html",
      "category": "casual",
      "type": "popular"
    },
    {
      "id": "game7",
      "name": "Shadow Assassin",
      "description": "In this stealthy assassin game, you'll operate in the shadows to complete various secret missions. Use stealth skills and deadly weapons to avoid detection and eliminate targets.",
      "image": "img/game7.jpg",
      "url": "games/game7.html",
      "category": "action",
      "type": "popular"
    },
    {
      "id": "game8",
      "name": "Monster Hunter",
      "description": "Explore a vast open world, track and hunt mysterious creatures. Collect resources, craft equipment, improve skills, and become a legendary monster hunter.",
      "image": "img/game8.jpg",
      "url": "games/game8.html",
      "category": "rpg",
      "type": "popular"
    },
    {
      "id": "game9",
      "name": "Jewel Maze",
      "description": "A fast-paced puzzle game where you match similar gems to create combos and unlock special abilities. Challenge time limits, compete with friends for high scores, and become a gem master.",
      "image": "img/game9.jpg",
      "url": "games/game9.html",
      "category": "puzzle",
      "type": "new"
    },
    {
      "id": "game10",
      "name": "Farm Life",
      "description": "Run your own farm, grow crops, raise animals, and expand your agricultural empire. Interact with villagers, participate in seasonal events, and experience the peaceful countryside life.",
      "image": "img/game10.jpg",
      "url": "games/game10.html",
      "category": "casual",
      "type": "new"
    },
    {
      "id": "game11",
      "name": "Pirate Treasure",
      "description": "Set sail and embark on an adventure to find legendary treasures. Explore mysterious islands, decode ancient maps, battle other pirates, and discover hidden wealth.",
      "image": "img/game11.jpg",
      "url": "games/game11.html",
      "category": "adventure",
      "type": "new"
    },
    {
      "id": "game12",
      "name": "Dragon Legend",
      "description": "Become a hero in this epic role-playing game, battle powerful dragons, and complete dangerous quests. Choose your class, develop skills, and change the fate of the world.",
      "image": "img/game12.jpg",
      "url": "games/game12.html",
      "category": "rpg",
      "type": "new"
    }
  ]
} 